In [1]:
import pandas as pd
pd.__version__

'1.4.3'

In [2]:
people = {
    'first_name': ['Ali', 'Raib', 'Seli', 'Ily'],
    'last_name': ['Bumi', 'Bulan', 'Matahari', 'Bulan'],
    'email': ['alibumi@gmail.com', 'raibbintang@gmail.com', 'selimatahari@gmail.com', 'ilybulan@gmail.com']
}

df = pd.DataFrame(people)

In [3]:
df

  first_name last_name                   email
0        Ali      Bumi       alibumi@gmail.com
1       Raib     Bulan   raibbintang@gmail.com
2       Seli  Matahari  selimatahari@gmail.com
3        Ily     Bulan      ilybulan@gmail.com

## Updating Columns

In [4]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [5]:
df.columns = ['first_name', 'clan', 'email']

In [6]:
df

  first_name      clan                   email
0        Ali      Bumi       alibumi@gmail.com
1       Raib     Bulan   raibbintang@gmail.com
2       Seli  Matahari  selimatahari@gmail.com
3        Ily     Bulan      ilybulan@gmail.com

In [7]:
df.columns = [x.lower() for x in df.columns]
df

  first_name      clan                   email
0        Ali      Bumi       alibumi@gmail.com
1       Raib     Bulan   raibbintang@gmail.com
2       Seli  Matahari  selimatahari@gmail.com
3        Ily     Bulan      ilybulan@gmail.com

In [8]:
df.columns = df.columns.str.replace(' ', '_')
df

  first_name      clan                   email
0        Ali      Bumi       alibumi@gmail.com
1       Raib     Bulan   raibbintang@gmail.com
2       Seli  Matahari  selimatahari@gmail.com
3        Ily     Bulan      ilybulan@gmail.com

In [9]:
df.rename(columns={'first_name': 'name'}, inplace=True)
df

   name      clan                   email
0   Ali      Bumi       alibumi@gmail.com
1  Raib     Bulan   raibbintang@gmail.com
2  Seli  Matahari  selimatahari@gmail.com
3   Ily     Bulan      ilybulan@gmail.com

## Updating Data

### Updating data in multiple columns

In [10]:
df.loc[0] = ['Ali', 'Sagaras', 'alibumi@gmail.com']
df

   name      clan                   email
0   Ali   Sagaras       alibumi@gmail.com
1  Raib     Bulan   raibbintang@gmail.com
2  Seli  Matahari  selimatahari@gmail.com
3   Ily     Bulan      ilybulan@gmail.com

### Updating data in a single column

In [11]:
df.loc[0, 'email'] = 'alisagaras@gmail.com'
df

   name      clan                   email
0   Ali   Sagaras    alisagaras@gmail.com
1  Raib     Bulan   raibbintang@gmail.com
2  Seli  Matahari  selimatahari@gmail.com
3   Ily     Bulan      ilybulan@gmail.com

In [12]:
df.at[3, 'clan'] = 'Matahari Minor'
df

   name            clan                   email
0   Ali         Sagaras    alisagaras@gmail.com
1  Raib           Bulan   raibbintang@gmail.com
2  Seli        Matahari  selimatahari@gmail.com
3   Ily  Matahari Minor      ilybulan@gmail.com

In [13]:
filt = df['email'] == 'alisagaras@gmail.com'
df[filt]['email'] = 'ali@sagaras.com' #it doesnt work

C:\Users\ASUS VIVOBOOK\AppData\Local\Temp\ipykernel_8444\2477074894.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['email'] = 'ali@sagaras.com' #it doesnt work

In [14]:
df.loc[filt, 'email'] = 'ali@sagaras.com' #it works
df

   name            clan                   email
0   Ali         Sagaras         ali@sagaras.com
1  Raib           Bulan   raibbintang@gmail.com
2  Seli        Matahari  selimatahari@gmail.com
3   Ily  Matahari Minor      ilybulan@gmail.com

In [15]:
df['email'] = df['email'].str.lower()

In [16]:
df

   name            clan                   email
0   Ali         Sagaras         ali@sagaras.com
1  Raib           Bulan   raibbintang@gmail.com
2  Seli        Matahari  selimatahari@gmail.com
3   Ily  Matahari Minor      ilybulan@gmail.com

### Apply with series

In [17]:
def update_email(email):
    return email.upper()

In [18]:
#apply -> works for df and series
df['email'] = df['email'].apply(update_email)
df

   name            clan                   email
0   Ali         Sagaras         ALI@SAGARAS.COM
1  Raib           Bulan   RAIBBINTANG@GMAIL.COM
2  Seli        Matahari  SELIMATAHARI@GMAIL.COM
3   Ily  Matahari Minor      ILYBULAN@GMAIL.COM

In [19]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

   name            clan                   email
0   Ali         Sagaras         ali@sagaras.com
1  Raib           Bulan   raibbintang@gmail.com
2  Seli        Matahari  selimatahari@gmail.com
3   Ily  Matahari Minor      ilybulan@gmail.com

In [20]:
def change_email(name):
    new_email = name + '@' + 'clan' + '.com'
    return new_email.lower()

In [21]:
df['email'] = df['name'].apply(change_email)
df

   name            clan          email
0   Ali         Sagaras   ali@clan.com
1  Raib           Bulan  raib@clan.com
2  Seli        Matahari  seli@clan.com
3   Ily  Matahari Minor   ily@clan.com

In [22]:
df['email'].apply(len)

0    12
1    13
2    13
3    12
Name: email, dtype: int64

### Apply with dataframes

In [23]:
#df len
df.apply(len)

name     4
clan     4
email    4
dtype: int64

In [24]:
df.apply(len, axis='columns')

0    3
1    3
2    3
3    3
dtype: int64

In [25]:
len(df['email'])

4

In [29]:
df

   name            clan          email
0   Ali         Sagaras   ali@clan.com
1  Raib           Bulan  raib@clan.com
2  Seli        Matahari  seli@clan.com
3   Ily  Matahari Minor   ily@clan.com

In [26]:
df.apply(pd.Series.min)

name              Ali
clan            Bulan
email    ali@clan.com
dtype: object

In [30]:
df.apply(lambda x: x.min())

name              Ali
clan            Bulan
email    ali@clan.com
dtype: object

### ApplyMap -> Apply to each individuals on dataframe 
(only works on dataframes)

In [31]:
df.applymap(len)

   name  clan  email
0     3     7     12
1     4     5     13
2     4     8     13
3     3    14     12

In [32]:
df.applymap(str.lower)

   name            clan          email
0   ali         sagaras   ali@clan.com
1  raib           bulan  raib@clan.com
2  seli        matahari  seli@clan.com
3   ily  matahari minor   ily@clan.com

### Map -> Apply to each values on series
(only works on series)

In [36]:
df

   name            clan          email
0   Ali         Sagaras   ali@clan.com
1  Raib           Bulan  raib@clan.com
2  Seli        Matahari  seli@clan.com
3   Ily  Matahari Minor   ily@clan.com

In [35]:
df['name'].map({'Ali': 'Ali Ceros', 'Raib': 'Putri Raib'})

0     Ali Ceros
1    Putri Raib
2           NaN
3           NaN
Name: name, dtype: object

### Replace -> Substitute only spesific values on series

In [38]:
df['name'].replace({'Ali': 'Ali Ceros', 'Raib': 'Putri Raib'})

0     Ali Ceros
1    Putri Raib
2          Seli
3           Ily
Name: name, dtype: object

In [39]:
df

   name            clan          email
0   Ali         Sagaras   ali@clan.com
1  Raib           Bulan  raib@clan.com
2  Seli        Matahari  seli@clan.com
3   Ily  Matahari Minor   ily@clan.com